app/controllers/todos_controller.rb

  def create
    @todo = Todo.create!(todo_params)
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Learn Elm"], ["created_by", "1"], ["created_at", 2017-04-20 00:59:24 UTC], ["updated_at", 2017-04-20 00:59:24 UTC]]

  def update
    @todo.update(todo_params)
---
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Shopping"], ["updated_at", 2017-04-20 00:59:24 UTC], ["id", 119]]